In [104]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os, sys
import matplotlib.pyplot as plt
np.random.seed(1234)
plt.rc('figure',figsize=(10,6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [108]:
cd tjdwn/pyData

C:\Users\tjdwn\pyData

In [109]:
df = pd.read_csv('ch06/ex1.csv')#데이터 구분자: ','
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_table('ch06/ex1.csv',sep=',')#데이터 구분자: '\t'

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
pd.read_fwf('ch06/ex1.csv',sep=',')#데이터 구분자가 없음

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [14]:
pd.read_clipboard()#클립보드 복사한거 보여줌, 엑셀 표 복사해도 바로됨

   a  b  c  d
x  1  2  2  3
y  1  2  3  4

In [21]:
pd.read_csv('ch06/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [24]:
names=['a','b','c','d','message']
pd.read_csv('ch06/ex2.csv',header=None,names=names)#names는 컬럼의 이름들

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
pd.read_csv('ch06/ex2.csv',names=names,index_col='message')#message col을 색인으로 사용

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [28]:
pd.read_csv('ch06/csv_mindex.csv')

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [27]:
parsed = pd.read_csv('ch06/csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [30]:
list(open('ch06/ex3.txt'))#white space가 포함된 문자열의 리스트로 표현

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [32]:
result= pd.read_table('ch06/ex3.txt',sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [35]:
list(open('ch06/ex4.csv'))

['# hey!\n',
 'a,b,c,d,message\n',
 '# just wanted to make things more difficult for you\n',
 '# who reads CSV files with computers, anyway?\n',
 '1,2,3,4,hello\n',
 '5,6,7,8,world\n',
 '9,10,11,12,foo']

In [34]:
pd.read_csv('ch06/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [33]:
pd.read_csv('ch06/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [37]:
result=pd.read_csv('ch06/ex5.csv')
result
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [41]:
result=pd.read_csv('ch06/ex5.csv',na_values=['one','two'])#na_values에 있는 값을은 NaN값으로 처리
result

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
sentinels = {'message':['foo','NA'],'something':['two']}#message col에서는 foo,NA 값이 있으면 NaN처리, something col에서는 two나오면 처리
pd.read_csv('ch06/ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [43]:
result = pd.read_csv('ch06/ex6.csv')

In [45]:
result.head(10)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [51]:
chunker = pd.read_csv('ch06/ex6.csv',chunksize=1000)#1000개만 읽어옴

tot = Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)
    
tot = tot.sort_values(ascending=False)
print(tot)
tot.sum(axis=0)

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
V    328.0
I    327.0
U    326.0
P    324.0
D    320.0
A    320.0
R    318.0
Y    314.0
G    308.0
S    308.0
N    306.0
W    305.0
T    304.0
B    302.0
Z    288.0
C    286.0
4    171.0
6    166.0
7    164.0
8    162.0
3    162.0
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
dtype: float64

10000.0

In [58]:
df = pd.read_csv('ch06/ex5.csv')#csv파일을 data frame형식으로 바꿔서 읽어옴
df.to_csv('ch06/out.csv')#data frame을 csv형식으로 바꿔서 저장
df.to_csv(sys.stdout)

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [59]:
df.to_csv(sys.stdout,na_rep = 'NULL')#누락된 값 채우기

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [63]:
df.to_csv(sys.stdout,index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [71]:
dates = pd.date_range('1/1/2000',periods=32)
ts = Series(np.arange(32),index=dates)
ts.to_csv('ch06/tseries.csv')

In [72]:
Series.from_csv('ch06/tseries.csv',parse_dates=True)

C:\Users\tjdwn\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\series.py:3724: FutureWarning: from_csv is deprecated. Please use read_csv(...) instead. Note that some of the default arguments are different, so please refer to the documentation for from_csv when changing your function calls
  infer_datetime_format=infer_datetime_format)

2000-01-01     0
2000-01-02     1
2000-01-03     2
2000-01-04     3
2000-01-05     4
2000-01-06     5
2000-01-07     6
2000-01-08     7
2000-01-09     8
2000-01-10     9
2000-01-11    10
2000-01-12    11
2000-01-13    12
2000-01-14    13
2000-01-15    14
2000-01-16    15
2000-01-17    16
2000-01-18    17
2000-01-19    18
2000-01-20    19
2000-01-21    20
2000-01-22    21
2000-01-23    22
2000-01-24    23
2000-01-25    24
2000-01-26    25
2000-01-27    26
2000-01-28    27
2000-01-29    28
2000-01-30    29
2000-01-31    30
2000-02-01    31
dtype: int64

In [81]:
import csv
f = open('ch06/ex7.csv')
reader=csv.reader(f)#reader의 내용은 한번 읽으면 사라진다.

In [80]:
for line in reader:
    print(line)

In [87]:
lines = list(csv.reader(open('ch06/ex7.csv')))
header, values = lines[0],lines[1:]
data_dict = {h:v for h, v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [90]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [91]:
with open('mydata.csv','w') as f:
    writer = csv.writer(f,dialect=my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [93]:
lines = list(csv.reader(open('mydata.csv')))
lines

[['one;two;three'], ['1;2;3'], ['4;5;6'], ['7;8;9']]

In [94]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"},
              {"name": "Katie", "age": 33, "pet": "Cisco"}]
}
"""

In [95]:
import json

result = json.loads(obj)#json을 파이썬 객체로!
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 25, 'pet': 'Zuko'},
  {'name': 'Katie', 'age': 33, 'pet': 'Cisco'}]}

In [97]:
asjson = json.dumps(result)#파이썬 객체를 json으로!
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"}, {"name": "Katie", "age": 33, "pet": "Cisco"}]}'

In [101]:
df= pd.DataFrame(result['siblings'],columns=['name','age','pet'])
df

    name  age    pet
0  Scott   25   Zuko
1  Katie   33  Cisco

In [111]:
frame = pd.read_csv('ch06/ex1.csv')
frame
frame.to_pickle('ch06/frame_pickle')

In [112]:
pd.read_pickle('ch06/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [126]:
import sqlite3

query='''
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL, d INTEGER);'''

con = sqlite3.connect(':memory:')
con.execute(query)
con.commit()

In [129]:
data = [('Atlanta', 'Georgia', 1.25,6),
       ('Tallahassee','Florida',2.6,3),
       ('Sacramento','California',1.7,5)]
stmt = 'INSERT INTO test VALUES(?,?,?,?)'
con.executemany(stmt,data)
con.commit()

In [135]:
cursor = con.execute('select * from test')
rows = cursor.fetchone()
rows

('Atlanta', 'Georgia', 1.25, 6)

In [136]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [143]:
pd.DataFrame(rows,columns=list(zip(*cursor.description))[0])

ValueError: DataFrame constructor not properly called!

In [144]:
import pandas.io.sql as sql
pd.read_sql('select * from test',con)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5